[
  {
    "id": "3d-web-experience",
    "path": "skills\\_core\\3d-web-experience",
    "name": "3d-web-experience",
    "description": "'Expert in building 3D experiences for the web - Three.js, React Three Fiber, Spline, WebGL, and interactive 3D scenes. Covers product configurators, 3D portfolios, immersive websites, and bringing depth to web experiences. Use when: 3D website, three.js, WebGL, react three fiber, 3D experience.'"
  },
  {
    "id": "active-directory-attacks",
    "path": "skills\\active-directory-attacks",
    "name": "Active Directory Attacks",
    "description": "This skill should be used when the user asks to \"attack Active Directory\", \"exploit AD\", \"Kerberoasting\", \"DCSync\", \"pass-the-hash\", \"BloodHound enumeration\", \"Golden Ticket\", \"Silver Ticket\", \"AS-REP roasting\", \"NTLM relay\", or needs guidance on Windows domain penetration testing."
  },
  {
    "id": "agent-tool-builder",
    "path": "skills\\_ai-tools\\agent-tool-builder",
    "name": "agent-tool-builder",
    "description": "\"Tools are how AI agents interact with the world. A well-designed tool is the difference between an agent that works and one that hallucinates, fails silently, or costs 10x more tokens than necessary.  This skill covers tool design from schema to error handling. JSON Schema best practices, description writing that actually helps the LLM, validation, and the emerging MCP standard that's becoming the lingua franca for AI tools.  Key insight: Tool descriptions are more important than tool implementa\""
  },
  {
    "id": "algolia-search",
    "path": "skills\\_tools\\algolia-search",
    "name": "algolia-search",
    "description": "'Expert patterns for Algolia search implementation, indexing strategies, React InstantSearch, and relevance tuning Use when: adding search to, algolia, instantsearch, search api, search functionality.'"
  },
  {
    "id": "algorithmic-art",
    "path": "skills\\algorithmic-art",
    "name": "algorithmic-art",
    "description": "Creating algorithmic art using p5.js with seeded randomness and interactive parameter exploration. Use this when users request creating art using code, generative art, algorithmic art, flow fields, or particle systems. Create original algorithmic art rather than copying existing artists' work to avoid copyright violations."
  },
  {
    "id": "analytics-tracking",
    "path": "skills\\_seo-marketing\\analytics-tracking",
    "name": "analytics-tracking",
    "description": "When the user wants to set up, improve, or audit analytics tracking and measurement. Also use when the user mentions \"set up tracking,\" \"GA4,\" \"Google Analytics,\" \"conversion tracking,\" \"event tracking,\" \"UTM parameters,\" \"tag manager,\" \"GTM,\" \"analytics implementation,\" or \"tracking plan.\" For A/B test measurement, see ab-test-setup."
  },
  {
    "id": "api-patterns",
    "path": "skills\\api-patterns",
    "name": "api-patterns",
    "description": "API design principles and decision-making. REST vs GraphQL vs tRPC selection, response formats, versioning, pagination."
  },
  {
    "id": "app-builder",
    "path": "skills\\app-builder",
    "name": "app-builder",
    "description": "Main application building orchestrator. Creates full-stack applications from natural language requests. Determines project type, selects tech stack, coordinates agents."
  },
  {
    "id": "architecture",
    "path": "skills\\_architecture\\architecture",
    "name": "architecture",
    "description": "Architectural decision-making framework. Requirements analysis, trade-off evaluation, ADR documentation. Use when making architecture decisions or analyzing system design."
  },
  {
    "id": "autonomous-agent-patterns",
    "path": "skills\\_ai-tools\\autonomous-agent-patterns",
    "name": "autonomous-agent-patterns",
    "description": "'Design patterns for building autonomous coding agents. Covers tool integration, permission systems, browser automation, and human-in-the-loop workflows. Use when building AI agents, designing tool APIs, implementing permission systems, or creating autonomous coding assistants.'"
  },
  {
    "id": "autonomous-agents",
    "path": "skills\\_ai-tools\\autonomous-agents",
    "name": "autonomous-agents",
    "description": "\"Autonomous agents are AI systems that can independently decompose goals, plan actions, execute tools, and self-correct without constant human guidance. The challenge isn't making them capable - it's making them reliable. Every extra decision multiplies failure probability.  This skill covers agent loops (ReAct, Plan-Execute), goal decomposition, reflection patterns, and production reliability. Key insight: compounding error rates kill autonomous agents. A 95% success rate per step drops to 60% b\""
  },
  {
    "id": "aws-penetration-testing",
    "path": "skills\\aws-penetration-testing",
    "name": "AWS Penetration Testing",
    "description": "This skill should be used when the user asks to \"pentest AWS\", \"test AWS security\", \"enumerate IAM\", \"exploit cloud infrastructure\", \"AWS privilege escalation\", \"S3 bucket testing\", \"metadata SSRF\", \"Lambda exploitation\", or needs guidance on Amazon Web Services security assessment."
  },
  {
    "id": "backend-dev-guidelines",
    "path": "skills\\backend-dev-guidelines",
    "name": "backend-dev-guidelines",
    "description": "Comprehensive backend development guide for Node.js/Express/TypeScript microservices. Use when creating routes, controllers, services, repositories, middleware, or working with Express APIs, Prisma database access, Sentry error tracking, Zod validation, unifiedConfig, dependency injection, or async patterns. Covers layered architecture (routes → controllers → services → repositories), BaseController pattern, error handling, performance monitoring, testing strategies, and migration from legacy patterns."
  },
  {
    "id": "bullmq-specialist",
    "path": "skills\\_tools\\bullmq-specialist",
    "name": "bullmq-specialist",
    "description": "'BullMQ expert for Redis-backed job queues, background processing, and reliable async execution in Node.js/TypeScript applications. Use when: bullmq, bull queue, redis queue, background job, job queue.'"
  },
  {
    "id": "canvas-design",
    "path": "skills\\canvas-design",
    "name": "canvas-design",
    "description": "Create beautiful visual art in .png and .pdf documents using design philosophy. You should use this skill when the user asks to create a poster, piece of art, design, or other static piece. Create original visual designs, never copying existing artists' work to avoid copyright violations."
  },
  {
    "id": "clean-code",
    "path": "skills\\_quality\\clean-code",
    "name": "clean-code",
    "description": "Pragmatic coding standards - concise, direct, no over-engineering, no unnecessary comments"
  },
  {
    "id": "clerk-auth",
    "path": "skills\\_tools\\clerk-auth",
    "name": "clerk-auth",
    "description": "'Expert patterns for Clerk auth implementation, middleware, organizations, webhooks, and user sync Use when: adding authentication, clerk auth, user authentication, sign in, sign up.'"
  },
  {
    "id": "cloud-penetration-testing",
    "path": "skills\\cloud-penetration-testing",
    "name": "Cloud Penetration Testing",
    "description": "This skill should be used when the user asks to \"perform cloud penetration testing\", \"assess Azure or AWS or GCP security\", \"enumerate cloud resources\", \"exploit cloud misconfigurations\", \"test O365 security\", \"extract secrets from cloud environments\", or \"audit cloud infrastructure\". It provides comprehensive techniques for security assessment across major cloud platforms."
  },
  {
    "id": "code-review-checklist",
    "path": "skills\\_quality\\code-review-checklist",
    "name": "code-review-checklist",
    "description": "Code review guidelines covering code quality, security, and best practices."
  },
  {
    "id": "content-creator",
    "path": "skills\\content-creator",
    "name": "content-creator",
    "description": "Create SEO-optimized marketing content with consistent brand voice. Includes brand voice analyzer, SEO optimizer, content frameworks, and social media templates. Use when writing blog posts, creating social media content, analyzing brand voice, optimizing SEO, planning content calendars, or when user mentions content creation, brand voice, SEO optimization, social media marketing, or content strategy."
  },
  {
    "id": "copy-editing",
    "path": "skills\\_seo-marketing\\copy-editing",
    "name": "copy-editing",
    "description": "\"When the user wants to edit, review, or improve existing marketing copy. Also use when the user mentions 'edit this copy,' 'review my copy,' 'copy feedback,' 'proofread,' 'polish this,' 'make this better,' or 'copy sweep.' This skill provides a systematic approach to editing marketing copy through multiple focused passes.\""
  },
  {
    "id": "copywriting",
    "path": "skills\\_seo-marketing\\copywriting",
    "name": "copywriting",
    "description": "When the user wants to write, rewrite, or improve marketing copy for any page — including homepage, landing pages, pricing pages, feature pages, about pages, or product pages. Also use when the user says \"write copy for,\" \"improve this copy,\" \"rewrite this page,\" \"marketing copy,\" \"headline help,\" or \"CTA copy.\" For email copy, see email-sequence. For popup copy, see popup-cro."
  },
  {
    "id": "claude-d3js-skill",
    "path": "skills\\claude-d3js-skill",
    "name": "d3-viz",
    "description": "Creating interactive data visualisations using d3.js. This skill should be used when creating custom charts, graphs, network diagrams, geographic visualisations, or any complex SVG-based data visualisation that requires fine-grained control over visual elements, transitions, or interactions. Use this for bespoke visualisations beyond standard charting libraries, whether in React, Vue, Svelte, vanilla JavaScript, or any other environment."
  },
  {
    "id": "database-design",
    "path": "skills\\database-design",
    "name": "database-design",
    "description": "Database design principles and decision-making. Schema design, indexing strategy, ORM selection, serverless databases."
  },
  {
    "id": "deployment-procedures",
    "path": "skills\\_devops\\deployment-procedures",
    "name": "deployment-procedures",
    "description": "Production deployment principles and decision-making. Safe deployment workflows, rollback strategies, and verification. Teaches thinking, not scripts."
  },
  {
    "id": "stitch-design-md",
    "path": "skills\\stitch-design-md",
    "name": "design-md",
    "description": "Analyze Stitch projects and synthesize a semantic design system into DESIGN.md files"
  },
  {
    "id": "docker-expert",
    "path": "skills\\_devops\\docker-expert",
    "name": "docker-expert",
    "description": "Docker containerization expert with deep knowledge of multi-stage builds, image optimization, container security, Docker Compose orchestration, and production deployment patterns. Use PROACTIVELY for Dockerfile optimization, container issues, image size problems, security hardening, networking, and orchestration challenges."
  },
  {
    "id": "docx-official",
    "path": "skills\\docx-official",
    "name": "docx",
    "description": "'Comprehensive document creation, editing, and analysis with support for tracked changes, comments, formatting preservation, and text extraction. When Claude needs to work with professional documents (.docx files) for: (1) Creating new documents, (2) Modifying or editing content, (3) Working with tracked changes, (4) Adding comments, or any other document tasks'"
  },
  {
    "id": "firebase",
    "path": "skills\\_core\\firebase",
    "name": "firebase",
    "description": "\"Firebase gives you a complete backend in minutes - auth, database, storage, functions, hosting. But the ease of setup hides real complexity. Security rules are your last line of defense, and they're often wrong. Firestore queries are limited, and you learn this after you've designed your data model.  This skill covers Firebase Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Storage, and Firebase Hosting. Key insight: Firebase is optimized for read-heavy, denormalized data. I\""
  },
  {
    "id": "frontend-design",
    "path": "skills\\_frontend\\frontend-design",
    "name": "frontend-design",
    "description": "Create distinctive, production-grade frontend interfaces with high design quality. Use this skill when the user asks to build web components, pages, artifacts, posters, or applications (examples include websites, landing pages, dashboards, React components, HTML/CSS layouts, or when styling/beautifying any web UI). Generates creative, polished code and UI design that avoids generic AI aesthetics."
  },
  {
    "id": "frontend-dev-guidelines",
    "path": "skills\\frontend-dev-guidelines",
    "name": "frontend-dev-guidelines",
    "description": "Frontend development guidelines for React/TypeScript applications. Modern patterns including Suspense, lazy loading, useSuspenseQuery, file organization with features directory, MUI v7 styling, TanStack Router, performance optimization, and TypeScript best practices. Use when creating components, pages, features, fetching data, styling, routing, or working with frontend code."
  },
  {
    "id": "game-development",
    "path": "skills\\game-development",
    "name": "game-development",
    "description": "Game development orchestrator. Routes to platform-specific skills based on project needs."
  },
  {
    "id": "geo-fundamentals",
    "path": "skills\\geo-fundamentals",
    "name": "geo-fundamentals",
    "description": "Generative Engine Optimization for AI search engines (ChatGPT, Claude, Perplexity)."
  },
  {
    "id": "git-pushing",
    "path": "skills\\git-pushing",
    "name": "git-pushing",
    "description": "Stage, commit, and push git changes with conventional commit messages. Use when user wants to commit and push changes, mentions pushing to remote, or asks to save and push their work. Also activates when user says \"push changes\", \"commit and push\", \"push this\", \"push to github\", or similar git workflow requests."
  },
  {
    "id": "github-workflow-automation",
    "path": "skills\\_devops\\github-workflow-automation",
    "name": "github-workflow-automation",
    "description": "'Automate GitHub workflows with AI assistance. Includes PR reviews, issue triage, CI/CD integration, and Git operations. Use when automating GitHub workflows, setting up PR review automation, creating GitHub Actions, or triaging issues.'"
  },
  {
    "id": "graphql",
    "path": "skills\\_backend\\graphql",
    "name": "graphql",
    "description": "'GraphQL gives clients exactly the data they need - no more, no less. One endpoint, typed schema, introspection. But the flexibility that makes it powerful also makes it dangerous. Without proper controls, clients can craft queries that bring down your server.  This skill covers schema design, resolvers, DataLoader for N+1 prevention, federation for microservices, and client integration with Apollo/urql. Key insight: GraphQL is a contract. The schema is the API documentation. Design it carefully.'"
  },
  {
    "id": "i18n-localization",
    "path": "skills\\i18n-localization",
    "name": "i18n-localization",
    "description": "Internationalization and localization patterns. Detecting hardcoded strings, managing translations, locale files, RTL support."
  },
  {
    "id": "inngest",
    "path": "skills\\_tools\\inngest",
    "name": "inngest",
    "description": "'Inngest expert for serverless-first background jobs, event-driven workflows, and durable execution without managing queues or workers. Use when: inngest, serverless background job, event-driven workflow, step function, durable execution.'"
  },
  {
    "id": "internal-comms-anthropic",
    "path": "skills\\internal-comms-anthropic",
    "name": "internal-comms",
    "description": "A set of resources to help me write all kinds of internal communications, using the formats that my company likes to use. Claude should use this skill whenever asked to write some sort of internal communications (status reports, leadership updates, 3P updates, company newsletters, FAQs, incident reports, project updates, etc.)."
  },
  {
    "id": "javascript-mastery",
    "path": "skills\\_frontend\\javascript-mastery",
    "name": "javascript-mastery",
    "description": "'Comprehensive JavaScript reference covering 33+ essential concepts every developer should know. From fundamentals like primitives and closures to advanced patterns like async/await and functional programming. Use when explaining JS concepts, debugging JavaScript issues, or teaching JavaScript fundamentals.'"
  },
  {
    "id": "lint-and-validate",
    "path": "skills\\lint-and-validate",
    "name": "lint-and-validate",
    "description": "Automatic quality control, linting, and static analysis procedures. Use after every code modification to ensure syntax correctness and project standards. Triggers onKeywords: lint, format, check, validate, types, static analysis."
  },
  {
    "id": "llm-app-patterns",
    "path": "skills\\_ai-tools\\llm-app-patterns",
    "name": "llm-app-patterns",
    "description": "'Production-ready patterns for building LLM applications. Covers RAG pipelines, agent architectures, prompt IDEs, and LLMOps monitoring. Use when designing AI applications, implementing RAG, building agents, or setting up LLM observability.'"
  },
  {
    "id": "loki-mode",
    "path": "skills\\loki-mode",
    "name": "loki-mode",
    "description": "Multi-agent autonomous startup system for Claude Code. Triggers on \"Loki Mode\". Orchestrates 100+ specialized agents across engineering, QA, DevOps, security, data/ML, business operations, marketing, HR, and customer success. Takes PRD to fully deployed, revenue-generating product with zero human intervention. Features Task tool for subagent dispatch, parallel code review with 3 specialized reviewers, severity-based issue triage, distributed task queue with dead letter handling, automatic deployment to cloud providers, A/B testing, customer feedback loops, incident response, circuit breakers, and self-healing. Handles rate limits via distributed state checkpoints and auto-resume with exponential backoff. Requires --dangerously-skip-permissions flag."
  },
  {
    "id": "marketing-ideas",
    "path": "skills\\_seo-marketing\\marketing-ideas",
    "name": "marketing-ideas",
    "description": "\"When the user needs marketing ideas, inspiration, or strategies for their SaaS or software product. Also use when the user asks for 'marketing ideas,' 'growth ideas,' 'how to market,' 'marketing strategies,' 'marketing tactics,' 'ways to promote,' or 'ideas to grow.' This skill provides 140 proven marketing approaches organized by category.\""
  },
  {
    "id": "marketing-psychology",
    "path": "skills\\_seo-marketing\\marketing-psychology",
    "name": "marketing-psychology",
    "description": "\"When the user wants to apply psychological principles, mental models, or behavioral science to marketing. Also use when the user mentions 'psychology,' 'mental models,' 'cognitive bias,' 'persuasion,' 'behavioral science,' 'why people buy,' 'decision-making,' or 'consumer behavior.' This skill provides 70+ mental models organized for marketing application.\""
  },
  {
    "id": "mcp-builder",
    "path": "skills\\mcp-builder",
    "name": "mcp-builder",
    "description": "Guide for creating high-quality MCP (Model Context Protocol) servers that enable LLMs to interact with external services through well-designed tools. Use when building MCP servers to integrate external APIs or services, whether in Python (FastMCP) or Node/TypeScript (MCP SDK)."
  },
  {
    "id": "mobile-design",
    "path": "skills\\mobile-design",
    "name": "mobile-design",
    "description": "Mobile-first design thinking and decision-making for iOS and Android apps. Touch interaction, performance patterns, platform conventions. Teaches principles, not fixed values. Use when building React Native, Flutter, or native mobile apps."
  },
  {
    "id": "nextjs-best-practices",
    "path": "skills\\_core\\nextjs-best-practices",
    "name": "nextjs-best-practices",
    "description": "Next.js App Router principles. Server Components, data fetching, routing patterns."
  },
  {
    "id": "nodejs-best-practices",
    "path": "skills\\_backend\\nodejs-best-practices",
    "name": "nodejs-best-practices",
    "description": "Node.js development principles and decision-making. Framework selection, async patterns, security, and architecture. Teaches thinking, not copying."
  },
  {
    "id": "notebooklm",
    "path": "skills\\notebooklm",
    "name": "notebooklm",
    "description": "Use this skill to query your Google NotebookLM notebooks directly from Claude Code for source-grounded, citation-backed answers from Gemini. Browser automation, library management, persistent auth. Drastically reduced hallucinations through document-only responses."
  },
  {
    "id": "page-cro",
    "path": "skills\\_seo-marketing\\page-cro",
    "name": "page-cro",
    "description": "When the user wants to optimize, improve, or increase conversions on any marketing page — including homepage, landing pages, pricing pages, feature pages, or blog posts. Also use when the user says \"CRO,\" \"conversion rate optimization,\" \"this page isn't converting,\" \"improve conversions,\" or \"why isn't this page working.\" For signup/registration flows, see signup-flow-cro. For post-signup activation, see onboarding-cro. For forms outside of signup, see form-cro. For popups/modals, see popup-cro."
  },
  {
    "id": "pdf-official",
    "path": "skills\\pdf-official",
    "name": "pdf",
    "description": "Comprehensive PDF manipulation toolkit for extracting text and tables, creating new PDFs, merging/splitting documents, and handling forms. When Claude needs to fill in a PDF form or programmatically process, generate, or analyze PDF documents at scale."
  },
  {
    "id": "performance-profiling",
    "path": "skills\\performance-profiling",
    "name": "performance-profiling",
    "description": "Performance profiling principles. Measurement, analysis, and optimization techniques."
  },
  {
    "id": "plaid-fintech",
    "path": "skills\\_tools\\plaid-fintech",
    "name": "plaid-fintech",
    "description": "'Expert patterns for Plaid API integration including Link token flows, transactions sync, identity verification, Auth for ACH, balance checks, webhook handling, and fintech compliance best practices. Use when: plaid, bank account linking, bank connection, ach, account aggregation.'"
  },
  {
    "id": "plan-writing",
    "path": "skills\\_architecture\\plan-writing",
    "name": "plan-writing",
    "description": "Structured task planning with clear breakdowns, dependencies, and verification criteria. Use when implementing features, refactoring, or any multi-step work."
  },
  {
    "id": "planning-with-files",
    "path": "skills\\planning-with-files",
    "name": "planning-with-files",
    "description": "Implements Manus-style file-based planning for complex tasks. Creates task_plan.md, findings.md, and progress.md. Use when starting complex multi-step tasks, research projects, or any task requiring >5 tool calls."
  },
  {
    "id": "playwright-skill",
    "path": "skills\\playwright-skill",
    "name": "playwright-skill",
    "description": "Complete browser automation with Playwright. Auto-detects dev servers, writes clean test scripts to /tmp. Test pages, fill forms, take screenshots, check responsive design, validate UX, test login flows, check links, automate any browser task. Use when user wants to test websites, automate browser interactions, validate web functionality, or perform any browser-based testing."
  },
  {
    "id": "pptx-official",
    "path": "skills\\pptx-official",
    "name": "pptx",
    "description": "'Presentation creation, editing, and analysis. When Claude needs to work with presentations (.pptx files) for: (1) Creating new presentations, (2) Modifying or editing content, (3) Working with layouts, (4) Adding comments or speaker notes, or any other presentation tasks'"
  },
  {
    "id": "product-manager-toolkit",
    "path": "skills\\product-manager-toolkit",
    "name": "product-manager-toolkit",
    "description": "Comprehensive toolkit for product managers including RICE prioritization, customer interview analysis, PRD templates, discovery frameworks, and go-to-market strategies. Use for feature prioritization, user research synthesis, requirement documentation, and product strategy development."
  },
  {
    "id": "prompt-engineer",
    "path": "skills\\_ai-tools\\prompt-engineer",
    "name": "prompt-engineer",
    "description": "'Expert in designing effective prompts for LLM-powered applications. Masters prompt structure, context management, output formatting, and prompt evaluation. Use when: prompt engineering, system prompt, few-shot, chain of thought, prompt design.'"
  },
  {
    "id": "prompt-engineering",
    "path": "skills\\_ai-tools\\prompt-engineering",
    "name": "prompt-engineering",
    "description": "Expert guide on prompt engineering patterns, best practices, and optimization techniques. Use when user wants to improve prompts, learn prompting strategies, or debug agent behavior."
  },
  {
    "id": "react-patterns",
    "path": "skills\\_core\\react-patterns",
    "name": "react-patterns",
    "description": "Modern React patterns and principles. Hooks, composition, performance, TypeScript best practices."
  },
  {
    "id": "react-ui-patterns",
    "path": "skills\\_core\\react-ui-patterns",
    "name": "react-ui-patterns",
    "description": "Modern React UI patterns for loading states, error handling, and data fetching. Use when building UI components, handling async data, or managing UI states."
  },
  {
    "id": "stitch-react-components",
    "path": "skills\\stitch-react-components",
    "name": "react:components",
    "description": "Converts Stitch designs into modular Vite and React components using system-level networking and AST-based validation."
  },
  {
    "id": "schema-markup",
    "path": "skills\\_seo-marketing\\schema-markup",
    "name": "schema-markup",
    "description": "When the user wants to add, fix, or optimize schema markup and structured data on their site. Also use when the user mentions \"schema markup,\" \"structured data,\" \"JSON-LD,\" \"rich snippets,\" \"schema.org,\" \"FAQ schema,\" \"product schema,\" \"review schema,\" or \"breadcrumb schema.\" For broader SEO issues, see seo-audit."
  },
  {
    "id": "segment-cdp",
    "path": "skills\\_tools\\segment-cdp",
    "name": "segment-cdp",
    "description": "'Expert patterns for Segment Customer Data Platform including Analytics.js, server-side tracking, tracking plans with Protocols, identity resolution, destinations configuration, and data governance best practices. Use when: segment, analytics.js, customer data platform, cdp, tracking plan.'"
  },
  {
    "id": "senior-architect",
    "path": "skills\\senior-architect",
    "name": "senior-architect",
    "description": "Comprehensive software architecture skill for designing scalable, maintainable systems using ReactJS, NextJS, NodeJS, Express, React Native, Swift, Kotlin, Flutter, Postgres, GraphQL, Go, Python. Includes architecture diagram generation, system design patterns, tech stack decision frameworks, and dependency analysis. Use when designing system architecture, making technical decisions, creating architecture diagrams, evaluating trade-offs, or defining integration patterns."
  },
  {
    "id": "senior-fullstack",
    "path": "skills\\senior-fullstack",
    "name": "senior-fullstack",
    "description": "Comprehensive fullstack development skill for building complete web applications with React, Next.js, Node.js, GraphQL, and PostgreSQL. Includes project scaffolding, code quality analysis, architecture patterns, and complete tech stack guidance. Use when building new projects, analyzing code quality, implementing design patterns, or setting up development workflows."
  },
  {
    "id": "seo-audit",
    "path": "skills\\_seo-marketing\\seo-audit",
    "name": "seo-audit",
    "description": "When the user wants to audit, review, or diagnose SEO issues on their site. Also use when the user mentions \"SEO audit,\" \"technical SEO,\" \"why am I not ranking,\" \"SEO issues,\" \"on-page SEO,\" \"meta tags review,\" or \"SEO health check.\" For building pages at scale to target keywords, see programmatic-seo. For adding structured data, see schema-markup."
  },
  {
    "id": "seo-fundamentals",
    "path": "skills\\seo-fundamentals",
    "name": "seo-fundamentals",
    "description": "SEO fundamentals, E-E-A-T, Core Web Vitals, and Google algorithm principles."
  },
  {
    "id": "server-management",
    "path": "skills\\_devops\\server-management",
    "name": "server-management",
    "description": "Server management principles and decision-making. Process management, monitoring strategy, and scaling decisions. Teaches thinking, not commands."
  },
  {
    "id": "shopify-development",
    "path": "skills\\shopify-development",
    "name": "shopify-development",
    "description": "|"
  },
  {
    "id": "skill-creator",
    "path": "skills\\skill-creator",
    "name": "skill-creator",
    "description": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Claude's capabilities with specialized knowledge, workflows, or tool integrations."
  },
  {
    "id": "slack-gif-creator",
    "path": "skills\\slack-gif-creator",
    "name": "slack-gif-creator",
    "description": "Knowledge and utilities for creating animated GIFs optimized for Slack. Provides constraints, validation tools, and animation concepts. Use when users request animated GIFs for Slack like \"make me a GIF of X doing Y for Slack.\""
  },
  {
    "id": "software-architecture",
    "path": "skills\\_architecture\\software-architecture",
    "name": "software-architecture",
    "description": "Guide for quality focused software architecture. This skill should be used when users want to write code, design architecture, analyze code, in any case that relates to software development."
  },
  {
    "id": "stitch-loop",
    "path": "skills\\stitch-loop",
    "name": "stitch-loop",
    "description": "Teaches agents to iteratively build websites using Stitch with an autonomous baton-passing loop pattern"
  },
  {
    "id": "stripe-integration",
    "path": "skills\\_core\\stripe-integration",
    "name": "stripe-integration",
    "description": "\"Get paid from day one. Payments, subscriptions, billing portal, webhooks, metered billing, Stripe Connect. The complete guide to implementing Stripe correctly, including all the edge cases that will bite you at 3am.  This isn't just API calls - it's the full payment system: handling failures, managing subscriptions, dealing with dunning, and keeping revenue flowing. Use when: stripe, payments, subscription, billing, checkout.\""
  },
  {
    "id": "systematic-debugging",
    "path": "skills\\_quality\\systematic-debugging",
    "name": "systematic-debugging",
    "description": "Use when encountering any bug, test failure, or unexpected behavior, before proposing fixes"
  },
  {
    "id": "tailwind-patterns",
    "path": "skills\\_core\\tailwind-patterns",
    "name": "tailwind-patterns",
    "description": "Tailwind CSS v4 principles. CSS-first configuration, container queries, modern patterns, design token architecture."
  },
  {
    "id": "tdd-workflow",
    "path": "skills\\_quality\\tdd-workflow",
    "name": "tdd-workflow",
    "description": "Test-Driven Development workflow principles. RED-GREEN-REFACTOR cycle."
  },
  {
    "id": "test-driven-development",
    "path": "skills\\_quality\\test-driven-development",
    "name": "test-driven-development",
    "description": "Use when implementing any feature or bugfix, before writing implementation code"
  },
  {
    "id": "testing-patterns",
    "path": "skills\\_quality\\testing-patterns",
    "name": "testing-patterns",
    "description": "Jest testing patterns, factory functions, mocking strategies, and TDD workflow. Use when writing unit tests, creating test factories, or following TDD red-green-refactor cycle."
  },
  {
    "id": "theme-factory",
    "path": "skills\\theme-factory",
    "name": "theme-factory",
    "description": "Toolkit for styling artifacts with a theme. These artifacts can be slides, docs, reportings, HTML landing pages, etc. There are 10 pre-set themes with colors/fonts that you can apply to any artifact that has been creating, or can generate a new theme on-the-fly."
  },
  {
    "id": "trigger-dev",
    "path": "skills\\_tools\\trigger-dev",
    "name": "trigger-dev",
    "description": "'Trigger.dev expert for background jobs, AI workflows, and reliable async execution with excellent developer experience and TypeScript-first design. Use when: trigger.dev, trigger dev, background task, ai background job, long running task.'"
  },
  {
    "id": "typescript-expert",
    "path": "skills\\typescript-expert",
    "name": "typescript-expert",
    "description": ">-"
  },
  {
    "id": "ui-ux-pro-max",
    "path": "skills\\ui-ux-pro-max",
    "name": "ui-ux-pro-max",
    "description": "'UI/UX design intelligence. 50 styles, 21 palettes, 50 font pairings, 20 charts, 9 stacks (React, Next.js, Vue, Svelte, SwiftUI, React Native, Flutter, Tailwind, shadcn/ui). Actions: plan, build, create, design, implement, review, fix, improve, optimize, enhance, refactor, check UI/UX code. Projects: website, landing page, dashboard, admin panel, e-commerce, SaaS, portfolio, blog, mobile app, .html, .tsx, .vue, .svelte. Elements: button, modal, navbar, sidebar, card, table, form, chart. Styles: glassmorphism, claymorphism, minimalism, brutalism, neumorphism, bento grid, dark mode, responsive, skeuomorphism, flat design. Topics: color palette, accessibility, animation, layout, typography, font pairing, spacing, hover, shadow, gradient. Integrations: shadcn/ui MCP for component search and examples.'"
  },
  {
    "id": "upstash-qstash",
    "path": "skills\\_tools\\upstash-qstash",
    "name": "upstash-qstash",
    "description": "'Upstash QStash expert for serverless message queues, scheduled jobs, and reliable HTTP-based task delivery without managing infrastructure. Use when: qstash, upstash queue, serverless cron, scheduled http, message queue serverless.'"
  },
  {
    "id": "vercel-deployment",
    "path": "skills\\_devops\\vercel-deployment",
    "name": "vercel-deployment",
    "description": "'Expert knowledge for deploying to Vercel with Next.js Use when: vercel, deploy, deployment, hosting, production.'"
  },
  {
    "id": "react-best-practices",
    "path": "skills\\react-best-practices",
    "name": "vercel-react-best-practices",
    "description": "React and Next.js performance optimization guidelines from Vercel Engineering. This skill should be used when writing, reviewing, or refactoring React/Next.js code to ensure optimal performance patterns. Triggers on tasks involving React components, Next.js pages, data fetching, bundle optimization, or performance improvements."
  },
  {
    "id": "vulnerability-scanner",
    "path": "skills\\vulnerability-scanner",
    "name": "vulnerability-scanner",
    "description": "Advanced vulnerability analysis principles. OWASP 2025, Supply Chain Security, attack surface mapping, risk prioritization."
  },
  {
    "id": "web-artifacts-builder",
    "path": "skills\\web-artifacts-builder",
    "name": "web-artifacts-builder",
    "description": "Suite of tools for creating elaborate, multi-component claude.ai HTML artifacts using modern frontend web technologies (React, Tailwind CSS, shadcn/ui). Use for complex artifacts requiring state management, routing, or shadcn/ui components - not for simple single-file HTML/JSX artifacts."
  },
  {
    "id": "web-design-guidelines",
    "path": "skills\\_frontend\\web-design-guidelines",
    "name": "web-design-guidelines",
    "description": "Review UI code for Web Interface Guidelines compliance. Use when asked to \"review my UI\", \"check accessibility\", \"audit design\", \"review UX\", or \"check my site against best practices\"."
  },
  {
    "id": "webapp-testing",
    "path": "skills\\webapp-testing",
    "name": "webapp-testing",
    "description": "Toolkit for interacting with and testing local web applications using Playwright. Supports verifying frontend functionality, debugging UI behavior, capturing browser screenshots, and viewing browser logs."
  },
  {
    "id": "writing-plans",
    "path": "skills\\_architecture\\writing-plans",
    "name": "writing-plans",
    "description": "Use when you have a spec or requirements for a multi-step task, before touching code"
  },
  {
    "id": "xlsx-official",
    "path": "skills\\_tools\\xlsx-official",
    "name": "xlsx",
    "description": "'Comprehensive spreadsheet creation, editing, and analysis with support for formulas, formatting, data analysis, and visualization. When Claude needs to work with spreadsheets (.xlsx, .xlsm, .csv, .tsv, etc) for: (1) Creating new spreadsheets with formulas and formatting, (2) Reading or analyzing data, (3) Modify existing spreadsheets while preserving formulas, (4) Data analysis and visualization in spreadsheets, or (5) Recalculating formulas'"
  }
]